app/controllers/admin_controller.rb

def save_password
  usrdetails = Userdetails.find_by_username(session[:username])

  if (params[:old_password] == usrdetails[:password]) && (params[:new_password] == params[:confirm_password])
    usrdetails.update_attributes!({:password => params[:new_password]})
---
SELECT * FROM `userdetails` WHERE (`userdetails`.`username` = 'admin') LIMIT 1
UPDATE `userdetails` SET `password` = 'admin1' WHERE `id` = 9

   def viewservice
    @servicetypes = TypesOfService.all
---
SELECT * FROM `types_of_services`