app/controllers/labor_controller.rb

def create
	labor = Labors.create(params[:labors])
	labor.types_of_service_id = params[:service_id]
	if labor.save
---
INSERT INTO `labors` (`types_of_service_id`, `labor_name`, `address`, `phone`, `charges`, `status`) VALUES(NULL, 'deepak', '407 ', 94588, 0, NULL)
UPDATE `labors` SET `types_of_service_id` = 2 WHERE `id` = 6