app/controllers/login_controller.rb

SELECT * FROM `userdetails` WHERE (`userdetails`.`username` = 'rashmi') LIMIT 1
---
  def index
    if session[:username]
      @userdetails = Userdetails.find_by_username(session[:username])

UPDATE `userdetails` SET `firstname` = 'dsfsdf', `lastname` = 'dfs', `birthday` = '2013-07-04', `email` = 'dfdsf', `phone` = 'sdfsdff' WHERE `id` = 2
---
  def update
    if @userdetails.update_attributes(params[:userdetails])

SELECT * FROM `userdetails` WHERE (`userdetails`.`username` = 'deepak') LIMIT 1
---
  def signin
  	puts "sigin action"

    session[:username] = params[:username]
      # To get from file use this
    # file = File.new("#{RAILS_ROOT}/tmp/file.txt", "r")
    # while (line = file.gets)
    #   username1= line.split(";").first.strip
    #   password1= line.split(";").last.strip
    #   if params[:username] == username1 && params[:password] == password1
    #     # file.close
    #     flash[:notice] = "Login successfull"
    #     render :template => "login/result"
    #     return
    #   end
    # end
    @userdetails = Userdetails.find_by_username(params[:username])

SELECT * FROM `userdetails` WHERE (`userdetails`.`username` = 'rashmi') LIMIT 1
INSERT INTO `userdetails` (`email`, `firstname`, `password`, `birthday`, `phone`, `username`, `lastname`) VALUES('rashmiagar@gmail.com', '', 'rashmi', NULL, '', 'rashmi', '')
---
def create_user
  p params[:username]

  @userdetails = Userdetails.find_by_username(params[:username])
  if @userdetails
    if @userdetails.username == params[:username]
      flash[:notice] = "User already exists !!!"
      render :template => "login/home"
      clear_flash_messages
      return
    end
  end

  @userdetails = Userdetails.new(:username => params[:username], :password => params[:password], :password_confirmation => params[:password_confirmation],
            :firstname => params[:firstname], :lastname => params[:lastname], :birthday => params[:birthday], :email => params[:email], :phone => params[:phone])
  if @userdetails.save

SELECT * FROM `userdetails` WHERE (`userdetails`.`username` = 'deepak') LIMIT 1
UPDATE `userdetails` SET `password` = 'deepak' WHERE `id` = 1
---
def save_password
  usrdetails = Userdetails.find_by_username(session[:username])

  if (params[:old_password] == usrdetails[:password]) && (params[:new_password] == params[:confirm_password])
    usrdetails.update_attributes!({:password => params[:new_password]})