app/controllers/services_controller.rb

  def index
    p "************"
    p params['userid']
    @userid = params['userid']
    @userdetails = Userdetails.find_by_id(params['userid'])
---
SELECT * FROM `userdetails` WHERE (`userdetails`.`id` IS NULL) LIMIT 1

  def create
    @newservice = TypesOfService.new(params["types_of_service"])
    if @newservice.valid?
      @newservice.save
---
INSERT INTO `types_of_services` (`service_name`, `created_at`, `updated_at`) VALUES('service3', '2013-07-17 08:52:23', '2013-07-17 08:52:23')

  def destroy
    service = TypesOfService.find(params[:id])
    service.destroy
---
SELECT * FROM `types_of_services` WHERE (`types_of_services`.`id` = 1)
DELETE FROM `types_of_services` WHERE `id` = 1